case_up_half_cube_01/0.orig/H2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0; // mass fraction

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    vent_a
    {
        type            inletOutlet;  //zeroGradient;
        inletValue      $internalField; 
        value           $internalField;        
    }
    vent_b
    {
        type            inletOutlet;  //zeroGradient;
        inletValue      $internalField; 
        value           $internalField;        
    }
}
// ************************************************************************* //
