case_up_half_cube_01/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);  

boundaryField
{
    walls
    {
        type            noSlip;
    }
    vent_a
    {
        type            pressureInletOutletVelocity;//fixedValue;
        phi             phi;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);                                                    //
    }
    vent_b
    {
        type            pressureInletOutletVelocity;//fixedValue;
        phi             phi;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);                                                    //
    }
}
// ************************************************************************* //
