case_up_half_cube_01/0.orig/air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0; // mass fraction

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    vent_a
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    vent_b
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}

// ************************************************************************* //
