case_up_half_cube_01/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 6.66e-5; // Initially zero, turbulence model will compute

boundaryField
{

    walls
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;        
    }
    vent_a
    {
        type            calculated;
        value           $internalField;
    }
    vent_b
    {
        type            calculated;
        value           $internalField;
    }
}
// ************************************************************************* //
