case_up_half_cube_01/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.6e-5; 

boundaryField
{

    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    vent_a
    {
        type            calculated;
        value           $internalField;
    }
    vent_b
    {
        type            calculated;
        value           $internalField;
    }
}
// ************************************************************************* //
