case_up_half_cube_01/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    walls
    {
        type            zeroGradient;
    }
    vent_a
    {
        type            calculated;//totalPressure;  //zeroGradient;
        value           $internalField;
    }
    vent_b
    {
        type            calculated;  //totalPressure;  //zeroGradient;
        value           $internalField;
    }
}
// ************************************************************************* //
