case_up_half_cube_01/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    vent_a
    {
        type            prghTotalPressure;//totalPressure;
        p0              uniform 101325;//$internalField;
    }
   vent_b
    {
        type            prghTotalPressure;//totalPressure;
        p0              uniform 101325;//$internalField;
    }

}
// ************************************************************************* //
