case_up_half_cube_01/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    source;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch "nozzle_wall";
        }
    }

    {
        name    source;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box (0 -0.006 0.999) (0.012 0.006 1.0004);
        }
    }

    {
        name    nozzle_wall_rest;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch "nozzle_wall";
        }
    }

    {
        name    nozzle_wall_rest;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     source;
    }
);
